verification/runs/ansys_verification/VMFL003/D_500x3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          3;
        startFace       2497;
    }
    outlet
    {
        type            patch;
        nFaces          3;
        startFace       2500;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       2503;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1500;
        startFace       3003;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1500;
        startFace       4503;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       6003;
    }
)

// ************************************************************************* //
